In [1]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns
from datetime import datetime,date,timedelta

### 1. Load `Table1_Customer_Details` into Pandas

In [2]:
# Load the Excel file to Pandas and list all the sheets

xls = pd.ExcelFile('Spreadsheets_Exercises.xlsx')
xls.sheet_names

['Table1_CustDetails',
 'Table2_ContractType',
 'Table3_PhoneService',
 'Table4_InternetService',
 'Table5_Dates',
 'Table6_Holidays',
 'Table7_Users',
 'Table8_Sparklines']

In [3]:
CustDetails = xls.parse('Table1_CustDetails')
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes

In [4]:
CustDetails.shape

(7049, 12)

In [5]:
CustDetails.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7049 entries, 0 to 7048
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        7049 non-null   object
 1   gender             7049 non-null   object
 2   is_senior_citizen  7049 non-null   int64
 3   partner            7049 non-null   object
 4   dependents         7049 non-null   object
 5   phone_service      7049 non-null   int64
 6   internet_service   7049 non-null   int64
 7   contract_type      7049 non-null   int64
 8   payment_type       7049 non-null   object
 9   monthly_charges    7049 non-null   float64
 10  total_charges      7038 non-null   float64
 11  churn              7049 non-null   object
dtypes: float64(2), int64(4), object(6)
memory usage: 661.0+ KB

In [6]:
# Check duplicates

CustDetails[CustDetails.duplicated(subset=['customer_id'])]

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
7031,0032-PGELS,Female,0,Yes,Yes,0,1,0,Bank transfer (automatic),30.5,30.50,Yes
7032,0036-IHMOT,Female,0,Yes,Yes,1,2,1,Bank transfer (automatic),103.7,5656.75,No
7033,0040-HALCW,Male,0,Yes,Yes,1,0,2,Credit card (automatic),20.4,1090.60,No
7034,0042-JVWOJ,Male,0,No,No,1,0,1,Bank transfer (automatic),19.6,471.85,No
7035,0042-RLHYP,Female,0,Yes,Yes,1,0,2,Bank transfer (automatic),19.7,1396.90,No
7036,0048-LUMLS,Male,0,Yes,Yes,1,2,1,Credit card (automatic),91.2,3247.55,No

### 2.Compute monthly tenure.

In [7]:
CustDetails['monthly_tenure'] = CustDetails.total_charges/CustDetails.monthly_charges
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128

### 3. Ensure the data format of each field is appropriate for data contained.

In [8]:
CustDetails.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7049 entries, 0 to 7048
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        7049 non-null   object
 1   gender             7049 non-null   object
 2   is_senior_citizen  7049 non-null   int64
 3   partner            7049 non-null   object
 4   dependents         7049 non-null   object
 5   phone_service      7049 non-null   int64
 6   internet_service   7049 non-null   int64
 7   contract_type      7049 non-null   int64
 8   payment_type       7049 non-null   object
 9   monthly_charges    7049 non-null   float64
 10  total_charges      7038 non-null   float64
 11  churn              7049 non-null   object
 12  monthly_tenure     7038 non-null   float64
dtypes: float64(3), int64(4), object(6)
memory usage: 716.0+ KB

### 4. Remove duplicate customer_id's.

In [9]:
# Check how many unique customer_ids in the data frame

CustDetails.customer_id.nunique()

7043

In [10]:
# Delete the extra row records which have the duplicated customer_id. 

CustDetails.drop_duplicates(subset=['customer_id'],inplace=True, ignore_index=True)
CustDetails.customer_id.nunique()

7043

In [11]:
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128

### Using the dates worksheet

In [12]:
dates = xls.parse('Table5_Dates')
dates.head()

        Date  Support Calls  Support Chats  Support Tickets
0 2018-12-01             21             89               69
1 2018-12-02             15             93               80
2 2018-12-03             62            186              197
3 2018-12-04             78            197              150
4 2018-12-05             89            200              158

In [13]:
dates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             33 non-null     datetime64[ns]
 1   Support Calls    33 non-null     int64
 2   Support Chats    33 non-null     int64
 3   Support Tickets  33 non-null     int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 1.2 KB

### 1. Add a new column that is the original date formatted as YYYYMMDD and stored as a date.

In [14]:
dates['Formatted Date'] = dates.Date.apply(lambda i: i.strftime('%Y%m%d'))
dates.head()

        Date  Support Calls  Support Chats  Support Tickets Formatted Date
0 2018-12-01             21             89               69       20181201
1 2018-12-02             15             93               80       20181202
2 2018-12-03             62            186              197       20181203
3 2018-12-04             78            197              150       20181204
4 2018-12-05             89            200              158       20181205

In [15]:
dates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Date             33 non-null     datetime64[ns]
 1   Support Calls    33 non-null     int64
 2   Support Chats    33 non-null     int64
 3   Support Tickets  33 non-null     int64
 4   Formatted Date   33 non-null     object
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 1.4+ KB

### 2.Insert 4 new columns that contain the weekday, day, month, year.

1. Add a new column named 'Weekday'. It will hold the number weekdays converted from dates using `Series.dt.weekday`. Monday is 0 and Sunday is 6. 
2. Convert the weekdays from numbers to names using `Series.map()`
3. Add new columns named 'Year', 'Month', and 'Day'.

In [16]:
dates['Weekday'] = dates.Date.dt.weekday
dates.head()

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday
0,2018-12-01,21,89,69,20181201,5
1,2018-12-02,15,93,80,20181202,6
2,2018-12-03,62,186,197,20181203,0
3,2018-12-04,78,197,150,20181204,1
4,2018-12-05,89,200,158,20181205,2

In [17]:
dates['Weekday'] = dates['Weekday'].map({0:'Monday', 
                                         1:'Tuesday', 
                                         2:'Wednesday', 
                                         3:'Thursday', 
                                         4:'Friday', 
                                         5:'Saturday', 
                                         6:'Sunday'})
dates.head()

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday
0,2018-12-01,21,89,69,20181201,Saturday
1,2018-12-02,15,93,80,20181202,Sunday
2,2018-12-03,62,186,197,20181203,Monday
3,2018-12-04,78,197,150,20181204,Tuesday
4,2018-12-05,89,200,158,20181205,Wednesday

In [18]:
dates['Year'] = dates.Date.dt.year
print(dates.Year.dtype)
dates.head()

int64

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year
0,2018-12-01,21,89,69,20181201,Saturday,2018
1,2018-12-02,15,93,80,20181202,Sunday,2018
2,2018-12-03,62,186,197,20181203,Monday,2018
3,2018-12-04,78,197,150,20181204,Tuesday,2018
4,2018-12-05,89,200,158,20181205,Wednesday,2018

In [19]:
dates['Month'] = dates.Date.dt.month
print(dates.Month.dtype)
dates.head()

int64

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year,Month
0,2018-12-01,21,89,69,20181201,Saturday,2018,12
1,2018-12-02,15,93,80,20181202,Sunday,2018,12
2,2018-12-03,62,186,197,20181203,Monday,2018,12
3,2018-12-04,78,197,150,20181204,Tuesday,2018,12
4,2018-12-05,89,200,158,20181205,Wednesday,2018,12

In [20]:
dates['Day'] = dates.Date.dt.day
print(dates.Day.dtype)
dates.head()

int64

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year,Month,Day
0,2018-12-01,21,89,69,20181201,Saturday,2018,12,1
1,2018-12-02,15,93,80,20181202,Sunday,2018,12,2
2,2018-12-03,62,186,197,20181203,Monday,2018,12,3
3,2018-12-04,78,197,150,20181204,Tuesday,2018,12,4
4,2018-12-05,89,200,158,20181205,Wednesday,2018,12,5

### 4. Insert 1 new column that computes the number of workdays from the current date (i.e. current row) through the latest date listed in the table. Reference the holidays table in your computation.

In [21]:
# Find out the latest date in the table

date_max = dates.Date.max()
date_max

Timestamp('2019-01-02 00:00:00')

In [22]:
# Reference the holidays table

holidays = xls.parse('Table6_Holidays')
holidays

    Holidays
0 2018-12-25
1 2019-01-01

In [23]:
# Created a variable named holidays_list that contains the holidays in a string format. 

holidays_list = [i.strftime('%Y-%m-%d') for i in holidays.Holidays]
holidays_list

['2018-12-25', '2019-01-01']

In [24]:
# Compute the workdays using np.busday_count()

dates['Workdays'] = dates.Date.apply(lambda i: np.busday_count(i.strftime('%Y-%m-%d'),
                                                               date_max.strftime('%Y-%m-%d'),
                                                               holidays=holidays_list)) + 1
dates.head()

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year,Month,Day,Workdays
0,2018-12-01,21,89,69,20181201,Saturday,2018,12,1,21
1,2018-12-02,15,93,80,20181202,Sunday,2018,12,2,21
2,2018-12-03,62,186,197,20181203,Monday,2018,12,3,21
3,2018-12-04,78,197,150,20181204,Tuesday,2018,12,4,20
4,2018-12-05,89,200,158,20181205,Wednesday,2018,12,5,19

### 4.Insert a new column that contains a 1 if the date is a workday and a 0 if not.

In [25]:
# Create a boolean series that meet the criteria

dates.Weekday.isin(['Saturday','Sunday']).head()

0     True
1     True
2    False
3    False
4    False
Name: Weekday, dtype: bool

In [26]:
dates['Formatted Date'].isin(['20181225','20190101']).head()

0    False
1    False
2    False
3    False
4    False
Name: Formatted Date, dtype: bool

In [27]:
boolean_mask = (dates.Weekday.isin(['Saturday','Sunday'])) | (dates['Formatted Date'].isin(['20181225','20190101']))
boolean_mask.head()

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [28]:
dates['Is Workday'] = boolean_mask
dates.head()

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year,Month,Day,Workdays,Is Workday
0,2018-12-01,21,89,69,20181201,Saturday,2018,12,1,21,True
1,2018-12-02,15,93,80,20181202,Sunday,2018,12,2,21,True
2,2018-12-03,62,186,197,20181203,Monday,2018,12,3,21,False
3,2018-12-04,78,197,150,20181204,Tuesday,2018,12,4,20,False
4,2018-12-05,89,200,158,20181205,Wednesday,2018,12,5,19,False

In [29]:
dates['Is Workday'] = dates['Is Workday'].apply(lambda i: 0 if i else 1)
dates.head()

,Date,Support Calls,Support Chats,Support Tickets,Formatted Date,Weekday,Year,Month,Day,Workdays,Is Workday
0,2018-12-01,21,89,69,20181201,Saturday,2018,12,1,21,0
1,2018-12-02,15,93,80,20181202,Sunday,2018,12,2,21,0
2,2018-12-03,62,186,197,20181203,Monday,2018,12,3,21,1
3,2018-12-04,78,197,150,20181204,Tuesday,2018,12,4,20,1
4,2018-12-05,89,200,158,20181205,Wednesday,2018,12,5,19,1

### Using the users worksheet

In [30]:
users = xls.parse('Table7_Users')
users.head()

   customer_id            username  domain.tld
0   7590-VHVEG        Olivia.Smith   gmail.com
1   5575-GNVDE         Emma.Garcia   yahoo.com
2   3668-QPYBK         Ava.Johnson   gmail.com
3   7795-CFOCW  Charlotte.Martinez  icloud.com
4   9237-HQITU        Mia.Williams   gmail.com

### 1.Insert a new column that is a clean version of customer_id, trimming any leading or trailing whitespace. All following tasks using the users table should reference the clean customer_id instead of the original.

In [31]:
users.customer_id.apply(lambda i: len(i)).head()

0    11
1    10
2    10
3    10
4    10
Name: customer_id, dtype: int64

In [32]:
users.customer_id = users.customer_id.str.strip()
users.customer_id.apply(lambda i: len(i)).head()

0    10
1    10
2    10
3    10
4    10
Name: customer_id, dtype: int64

### 2. Split the customer id into 2 columns where the characters before the hyphen are one column and the characters after the hyphen are another. Ensure the data format of these new columns is appropriate for the data contained. This might require multiple steps.

In [33]:
username_split = users.customer_id.str.split('-').to_list()
df = pd.DataFrame(username_split,
                 columns = ['id_numbers','id_letters'])
df.head

<bound method NDFrame.head of    id_numbers id_letters
0        7590      VHVEG
1        5575      GNVDE
2        3668      QPYBK
3        7795      CFOCW
4        9237      HQITU
5        9305      CDSKC
6        1452      KIOVK
7        6713      OKOMC
8        7892      POOKP
9        6388      TABGU
10       9763      GRSKD
11       7469      LKBCI
12       8091      TTVAX
13       0280      XJGEX
14       5129      JLPIS
15       3655      SNQYZ
16       8191      XWSZG
17       9959      WOFKT
18       4190      MFLUW
19       4183      MYFRB
20       8779      QRDMV
21       1680      VDCWW
22       1066      JKSGK
23       4472      LVYGI
24       3638      WEABW>

In [34]:
df.index

RangeIndex(start=0, stop=25, step=1)

In [35]:
users.index

RangeIndex(start=0, stop=25, step=1)

In [36]:
users = pd.merge(users, df, on=users.index, how='inner')
users.head()

   key_0 customer_id            username  domain.tld id_numbers id_letters
0      0  7590-VHVEG        Olivia.Smith   gmail.com       7590      VHVEG
1      1  5575-GNVDE         Emma.Garcia   yahoo.com       5575      GNVDE
2      2  3668-QPYBK         Ava.Johnson   gmail.com       3668      QPYBK
3      3  7795-CFOCW  Charlotte.Martinez  icloud.com       7795      CFOCW
4      4  9237-HQITU        Mia.Williams   gmail.com       9237      HQITU

### 3.Add the email address for each customer, using the data available in this table.

In [37]:
"@".join([users.username.iat[0],users['domain.tld'].iat[0]])

'Olivia.Smith@gmail.com'

In [38]:
users['email'] = ["@".join([users.username.iat[i],users['domain.tld'].iat[i]]) for i in users.index]
users.head()

,key_0,customer_id,username,domain.tld,id_numbers,id_letters,email
0,0,7590-VHVEG,Olivia.Smith,gmail.com,7590,VHVEG,Olivia.Smith@gmail.com
1,1,5575-GNVDE,Emma.Garcia,yahoo.com,5575,GNVDE,Emma.Garcia@yahoo.com
2,2,3668-QPYBK,Ava.Johnson,gmail.com,3668,QPYBK,Ava.Johnson@gmail.com
3,3,7795-CFOCW,Charlotte.Martinez,icloud.com,7795,CFOCW,Charlotte.Martinez@icloud.com
4,4,9237-HQITU,Mia.Williams,gmail.com,9237,HQITU,Mia.Williams@gmail.com

### Using your customer details worksheet

In [39]:
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128

### 1. Add new columns, is_female, has_churned, has_phone, has_internet, and has_phone_and_internet. Populate these fields with the applicable boolean value (TRUE or FALSE).

In [40]:
CustDetails['is_Female'] = CustDetails.gender.apply(lambda i: True if i == 'Female' else (False if i == 'Male' else "Error"))
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True

In [41]:
CustDetails['has_churned'] = CustDetails.churn.map({'No':False,'Yes':True})
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True,False
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False,False
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False,True
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False,True
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True,True

In [42]:
# Check Table4_InternetService

internet = xls.parse('Table4_InternetService')
internet

   internet_service_id internet_service_description
0                    0          No Internet Service
1                    1                          DSL
2                    2                  Fiber Optic

In [43]:
CustDetails['has_internet'] = CustDetails.internet_service.map({0:'False', 1:True, 2:True})
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned,has_internet
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True,False,True
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False,False,True
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False,True,True
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False,True,True
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True,True,True

In [44]:
phone = xls.parse('Table3_PhoneService')
phone

   phone_service_id phone_service_description
0                 0          No Phone Service
1                 1                  One Line
2                 2         Two or More Lines

In [45]:
CustDetails['has_phone'] = CustDetails.phone_service.map({0:'False', 1:True, 2:True})
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned,has_internet,has_phone
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True,False,True,True
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False,False,True,True
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False,True,True,True
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False,True,True,True
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True,True,True,True

In [46]:
boolean_phone = (CustDetails.phone_service == 1)|(CustDetails.phone_service == 2)
boolean_phone

0        True
1        True
2        True
3        True
4        True
        ...
7038     True
7039     True
7040     True
7041     True
7042    False
Name: phone_service, Length: 7043, dtype: bool

In [47]:
boolean_internet = (CustDetails.internet_service == 1)|(CustDetails.internet_service == 2)
boolean_internet

0       True
1       True
2       True
3       True
4       True
        ...
7038    True
7039    True
7040    True
7041    True
7042    True
Name: internet_service, Length: 7043, dtype: bool

In [48]:
CustDetails['has_phone_and_internet'] = boolean_phone & boolean_internet

In [49]:
CustDetails.tail()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned,has_internet,has_phone,has_phone_and_internet
7038,9987-LUTYD,Female,0,No,No,1,1,1,Mailed check,55.15,742.90,No,13.470535,True,False,True,True,True
7039,9992-RRAMN,Male,0,Yes,No,2,2,0,Electronic check,85.10,1873.70,Yes,22.017626,False,True,True,True,True
7040,9992-UJOEL,Male,0,No,No,1,1,0,Mailed check,50.30,92.75,No,1.843936,False,False,True,True,True
7041,9993-LHIEB,Male,0,Yes,Yes,1,1,2,Mailed check,67.85,4627.65,No,68.204127,False,False,True,True,True
7042,9995-HOTOH,Male,0,Yes,Yes,0,1,2,Electronic check,59.00,3707.60,No,62.840678,False,False,True,False,False

### 2. Insert a new column partner_dependents that returns a 0 for no partners and no dependents, 1 indicates partner only, 2 indicates dependents only, 3 indicates partner & dependents.

In [50]:
# if...else (functin) --> apply to rows

CustDetails.iloc[7042]['partner']

'Yes'

In [51]:
def partner_dependents(row):
    if row['partner'] == "No" and row['dependents'] == "No":
        return 0
    elif row['partner'] == "Yes" and row['dependents'] == "No":
        return 1
    elif row['partner'] == "No" and row['dependents'] == "Yes":
        return 2
    elif row['partner'] == "Yes" and row['dependents'] == "Yes":
        return 3
    else:
        return "Value Error"
    
partner_dependents(CustDetails.iloc[7042])

3

In [52]:
CustDetails['partner_dependents'] = CustDetails.apply(partner_dependents,axis=1)
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned,has_internet,has_phone,has_phone_and_internet,partner_dependents
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True,False,True,True,True,3
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False,False,True,True,True,0
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False,True,True,True,True,0
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False,True,True,True,True,1
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True,True,True,True,True,1

In [53]:
# How do I do data validation?

### 3. Insert a new field that computes the start date, based on the assumption that the tenure was calculated today. Format the columns to be YYYY-MM-DD.

In [54]:
(date.today() - timedelta(days=CustDetails['monthly_tenure'][1]*30.4)).isoformat()

'2019-11-21'

In [55]:
# Can't use list comprehension due to the NaN vaue in the montly_tenure column. 
CustDetails['monthly_tenure'].hasnans

True

In [56]:
CustDetails.monthly_tenure.iloc[945]

nan

In [57]:
def start_date(tenure):
    if str(tenure) == 'nan':
        return 'Nan'
    else:
        return (date.today() - timedelta(days = tenure*30.4)).isoformat()
    
CustDetails['start_date'] = CustDetails.monthly_tenure.apply(start_date)

In [58]:
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,monthly_tenure,is_Female,has_churned,has_internet,has_phone,has_phone_and_internet,partner_dependents,start_date
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,9.044207,True,False,True,True,True,3,2019-11-22
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,9.055092,False,False,True,True,True,0,2019-11-21
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,3.800406,False,True,True,True,True,0,2020-04-29
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes,12.631122,False,True,True,True,True,1,2019-08-05
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes,3.187128,True,True,True,True,True,1,2020-05-18

### 4. Insert a new column that computes average monthly charges using total_charges and tenure. (do not copy the "monthly_charges" column). Format the data type appropriately. Use a function to validate that your calculations match the original field monthly_charges.

In [59]:
CustDetails['average_monthly'] = CustDetails.total_charges/CustDetails.monthly_tenure
CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,churn,monthly_tenure,is_Female,has_churned,has_internet,has_phone,has_phone_and_internet,partner_dependents,start_date,average_monthly
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,...,No,9.044207,True,False,True,True,True,3,2019-11-22,65.6
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,...,No,9.055092,False,False,True,True,True,0,2019-11-21,59.9
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,...,Yes,3.800406,False,True,True,True,True,0,2020-04-29,73.9
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,...,Yes,12.631122,False,True,True,True,True,1,2019-08-05,98.0
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,...,Yes,3.187128,True,True,True,True,True,1,2020-05-18,83.9

### 5. Using the reference tables of contract type, phone service and internet service, add the descriptions of each to your customer details table using vlookups.

In [60]:
contract_type = xls.parse('Table2_ContractType')
contract_type

   contract_id contract_description
0            0       Month-to-Month
1            1               1 Year
2            2               2 Year

In [61]:
CustDetails['contract_description'] = CustDetails.contract_type.map({0:'Month-to-Month', 
                                                                     1:'1 Year', 
                                                                     2:'2 Year'})

CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,monthly_tenure,is_Female,has_churned,has_internet,has_phone,has_phone_and_internet,partner_dependents,start_date,average_monthly,contract_description
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,...,9.044207,True,False,True,True,True,3,2019-11-22,65.6,1 Year
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,...,9.055092,False,False,True,True,True,0,2019-11-21,59.9,Month-to-Month
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,...,3.800406,False,True,True,True,True,0,2020-04-29,73.9,Month-to-Month
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,...,12.631122,False,True,True,True,True,1,2019-08-05,98.0,Month-to-Month
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,...,3.187128,True,True,True,True,True,1,2020-05-18,83.9,Month-to-Month

In [62]:
phone_service = xls.parse('Table3_PhoneService')
phone_service

   phone_service_id phone_service_description
0                 0          No Phone Service
1                 1                  One Line
2                 2         Two or More Lines

In [63]:
CustDetails['phone_description'] = CustDetails.phone_service.map({0:'No Phone Service', 1:'One Line', 2:'Two or More Lines'})

CustDetails.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,is_Female,has_churned,has_internet,has_phone,has_phone_and_internet,partner_dependents,start_date,average_monthly,contract_description,phone_description
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,...,True,False,True,True,True,3,2019-11-22,65.6,1 Year,One Line
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,...,False,False,True,True,True,0,2019-11-21,59.9,Month-to-Month,Two or More Lines
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,...,False,True,True,True,True,0,2020-04-29,73.9,Month-to-Month,One Line
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,...,False,True,True,True,True,1,2019-08-05,98.0,Month-to-Month,One Line
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,...,True,True,True,True,True,1,2020-05-18,83.9,Month-to-Month,One Line

In [64]:
internet_service = xls.parse('Table4_InternetService')
internet_service

   internet_service_id internet_service_description
0                    0          No Internet Service
1                    1                          DSL
2                    2                  Fiber Optic

In [65]:
CustDetails['internet_description'] = CustDetails.internet_service.map({0:'No Internet Service', 
                                                                     1:'DSL', 
                                                                     2:'Fiber Optic'})
CustDetails.sample(5)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,has_churned,has_internet,has_phone,has_phone_and_internet,partner_dependents,start_date,average_monthly,contract_description,phone_description,internet_description
7029,9972-NKTFD,Female,0,No,No,1,1,0,Bank transfer (automatic),54.65,...,False,True,True,True,0,2018-05-01,54.65,Month-to-Month,One Line,DSL
4174,5899-OUVKV,Male,0,No,No,1,2,0,Electronic check,94.50,...,False,True,True,True,0,2018-01-07,94.50,Month-to-Month,One Line,Fiber Optic
4741,6682-QJDGB,Male,0,No,Yes,1,1,0,Mailed check,55.25,...,True,True,True,True,2,2017-06-02,55.25,Month-to-Month,One Line,DSL
519,0754-UKWQP,Male,0,No,No,1,2,0,Electronic check,95.85,...,True,True,True,True,0,2020-06-21,95.85,Month-to-Month,One Line,Fiber Optic
4972,6994-FGRHH,Male,0,Yes,Yes,1,2,1,Electronic check,106.15,...,False,True,True,True,3,2014-10-13,106.15,1 Year,One Line,Fiber Optic

## Spreadsheet Visualizations

### 1. What are the average monthly charges for each customer age group (full months of tenure) with each service combination (phone, internet, phone & internet)?

In [66]:
# Does columns phone_service and internet_service have Nan values? 

print(CustDetails.phone_service.hasnans)
print(CustDetails.internet_service.hasnans)

False
False

In [67]:
# 0 represent no phone service; 1 and 2 indicates having phone service
CustDetails.phone_service.unique()

array([1, 2, 0])

In [68]:
CustDetails.internet_service.unique()

array([1, 2, 0])

In [69]:
CustDetails.iloc[0]['phone_service']

1

In [70]:
def service_type(row):
    if row['phone_service'] == 0:
        if row['internet_service'] == 0:
            return 'No Service'
        else:
            return 'internet only'
    if row['phone_service'] != 0:
        if row['internet_service'] == 0:
            return 'phone only'
        else:
            return 'phone & internet'
        
service_type(CustDetails.iloc[100])

'phone only'

In [71]:
CustDetails['service_type'] = CustDetails.apply(service_type, axis=1)
CustDetails.sample(5)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,...,has_internet,has_phone,has_phone_and_internet,partner_dependents,start_date,average_monthly,contract_description,phone_description,internet_description,service_type
4945,6963-KQYQB,Female,0,Yes,Yes,2,0,2,Mailed check,24.05,...,False,True,False,3,2014-07-15,24.05,2 Year,Two or More Lines,No Internet Service,phone only
2200,3154-CFSZG,Male,0,Yes,Yes,1,2,0,Electronic check,90.05,...,True,True,True,3,2016-10-26,90.05,Month-to-Month,One Line,Fiber Optic,phone & internet
5956,8398-TBIYD,Female,0,No,No,2,2,2,Bank transfer (automatic),84.70,...,True,True,True,0,2014-07-26,84.70,2 Year,Two or More Lines,Fiber Optic,phone & internet
479,0699-NDKJM,Female,0,Yes,No,0,1,0,Bank transfer (automatic),58.75,...,True,False,False,1,2015-10-10,58.75,Month-to-Month,No Phone Service,DSL,internet only
6352,8992-OBVDG,Male,0,No,No,1,1,0,Mailed check,61.65,...,True,True,True,0,2018-10-05,61.65,Month-to-Month,One Line,DSL,phone & internet

In [72]:
CustDetails.axes

[RangeIndex(start=0, stop=7043, step=1),
 Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents',
        'phone_service', 'internet_service', 'contract_type', 'payment_type',
        'monthly_charges', 'total_charges', 'churn', 'monthly_tenure',
        'is_Female', 'has_churned', 'has_internet', 'has_phone',
        'has_phone_and_internet', 'partner_dependents', 'start_date',
        'average_monthly', 'contract_description', 'phone_description',
        'internet_description', 'service_type'],
       dtype='object')]

In [73]:
CustDetails.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 25 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   customer_id             7043 non-null   object
 1   gender                  7043 non-null   object
 2   is_senior_citizen       7043 non-null   int64
 3   partner                 7043 non-null   object
 4   dependents              7043 non-null   object
 5   phone_service           7043 non-null   int64
 6   internet_service        7043 non-null   int64
 7   contract_type           7043 non-null   int64
 8   payment_type            7043 non-null   object
 9   monthly_charges         7043 non-null   float64
 10  total_charges           7032 non-null   float64
 11  churn                   7043 non-null   object
 12  monthly_tenure          7032 non-null   float64
 13  is_Female               7043 non-null   bool
 14  has_churned             7043 non-null   bool
 15  has_internet            7043 non-null   object
 16  has_phone               7043 non-null   object
 17  has_phone_and_internet  7043 non-null   bool
 18  partner_dependents      7043 non-null   int64
 19  start_date              7043 non-null   object
 20  average_monthly         7032 non-null   float64
 21  contract_description    7043 non-null   object
 22  phone_description       7043 non-null   object
 23  internet_description    7043 non-null   object
 24  service_type            7043 non-null   object
dtypes: bool(3), float64(4), int64(5), object(13)
memory usage: 1.2+ MB

In [99]:
# Choose columns that I need

mytable_customer_details = CustDetails.iloc[:, [0,2,3,4,9,10,12,13,14,24]]
mytable_customer_details.sample(5)

,customer_id,is_senior_citizen,partner,dependents,monthly_charges,total_charges,monthly_tenure,is_Female,has_churned,service_type
1599,2325-WINES,0,No,No,104.05,3416.85,32.838539,True,False,phone & internet
5981,8434-PNQZX,0,No,No,78.45,3373.40,43.000637,True,False,phone & internet
6255,8851-RAGOV,0,Yes,No,71.05,1837.70,25.864884,True,False,phone & internet
318,0471-LVHGK,0,Yes,No,73.00,3001.20,41.112329,False,True,phone & internet
5889,8280-MQRQN,0,No,No,50.45,50.45,1.000000,True,True,phone & internet

In [100]:
mytable_customer_details.monthly_tenure.hasnans

True

In [101]:
mytable_customer_details.index

RangeIndex(start=0, stop=7043, step=1)

In [102]:
for i in mytable_customer_details.index:
    if str(mytable_customer_details.iloc[i]['monthly_tenure']) == 'nan':
        print(mytable_customer_details.iloc[i])

customer_id             1371-DWPAZ
is_senior_citizen                0
partner                        Yes
dependents                     Yes
monthly_charges              56.05
total_charges                  NaN
monthly_tenure                 NaN
is_Female                     True
has_churned                  False
service_type         internet only
Name: 945, dtype: object
customer_id          2520-SGTTA
is_senior_citizen             0
partner                     Yes
dependents                  Yes
monthly_charges              20
total_charges               NaN
monthly_tenure              NaN
is_Female                  True
has_churned               False
service_type         phone only
Name: 1731, dtype: object
customer_id                2775-SEFEE
is_senior_citizen                   0
partner                            No
dependents                        Yes
monthly_charges                  61.9
total_charges                     NaN
monthly_tenure                    NaN
is_Female                       False
has_churned                     False
service_type         phone & internet
Name: 1906, dtype: object
customer_id          2923-ARZLG
is_senior_citizen             0
partner                     Yes
dependents                  Yes
monthly_charges            19.7
total_charges               NaN
monthly_tenure              NaN
is_Female                 False
has_churned               False
service_type         phone only
Name: 2025, dtype: object
customer_id          3115-CZMZD
is_senior_citizen             0
partner                      No
dependents                  Yes
monthly_charges           20.25
total_charges               NaN
monthly_tenure              NaN
is_Female                 False
has_churned               False
service_type         phone only
Name: 2176, dtype: object
customer_id          3213-VVOLG
is_senior_citizen             0
partner                     Yes
dependents                  Yes
monthly_charges           25.35
total_charges               NaN
monthly_tenure              NaN
is_Female                 False
has_churned               False
service_type         phone only
Name: 2250, dtype: object
customer_id                4075-WKNIU
is_senior_citizen                   0
partner                           Yes
dependents                        Yes
monthly_charges                 73.35
total_charges                     NaN
monthly_tenure                    NaN
is_Female                        True
has_churned                     False
service_type         phone & internet
Name: 2855, dtype: object
customer_id          4367-NUYAO
is_senior_citizen             0
partner                     Yes
dependents                  Yes
monthly_charges           25.75
total_charges               NaN
monthly_tenure              NaN
is_Female                 False
has_churned               False
service_type         phone only
Name: 3052, dtype: object
customer_id             4472-LVYGI
is_senior_citizen                0
partner                        Yes
dependents                     Yes
monthly_charges              52.55
total_charges                  NaN
monthly_tenure                 NaN
is_Female                     True
has_churned                  False
service_type         internet only
Name: 3118, dtype: object
customer_id                5709-LVOEQ
is_senior_citizen                   0
partner                           Yes
dependents                        Yes
monthly_charges                 80.85
total_charges                     NaN
monthly_tenure                    NaN
is_Female                        True
has_churned                     False
service_type         phone & internet
Name: 4054, dtype: object
customer_id          7644-OMVMY
is_senior_citizen             0
partner                     Yes
dependents                  Yes
monthly_charges           19.85
total_charges               NaN
monthly_tenure              NaN
is_Female                 False
has_churned               False
service_type         phone only
Name: 5433, dtype: object

In [103]:
for i in mytable_customer_details.index:
    if str(mytable_customer_details.iloc[i]['monthly_tenure']) == 'nan':
        mytable_customer_details.monthly_tenure.iloc[i] = 1

/usr/local/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)
/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [104]:
mytable_customer_details.monthly_tenure.hasnans

False

In [105]:
mytable_customer_details['monthly_tenure'] = mytable_customer_details.monthly_tenure.apply(lambda i: int(i))

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [106]:
mytable_customer_details.sample(5)

,customer_id,is_senior_citizen,partner,dependents,monthly_charges,total_charges,monthly_tenure,is_Female,has_churned,service_type
639,0936-NQLJU,0,Yes,No,20.65,875.55,42,True,False,phone only
6810,9667-TKTVZ,0,No,No,54.35,117.05,2,True,False,phone & internet
4621,6516-NKQBO,0,Yes,Yes,81.00,3084.90,38,False,False,phone & internet
6560,9318-NKNFC,0,No,No,18.85,18.85,1,False,True,phone only
4883,6877-TJMBR,0,Yes,No,84.80,84.80,1,False,True,phone & internet

In [108]:
#

table = pd.pivot_table(mytable_customer_details, 
                       values = ['monthly_charges'], 
                       index = ['monthly_tenure'], 
                       columns = ['service_type'], 
                       aggfunc=np.mean)
table

               monthly_charges
service_type     internet only phone & internet phone only
monthly_tenure
1                    31.330667        67.276715  20.168844
2                    32.881250        71.880921  20.064103
3                    33.109259        74.074180  20.504054
4                    37.656250        71.781304  20.611429
5                    41.729167        78.469737  20.536207
...                        ...              ...        ...
74                   62.025000        94.712500  23.563636
75                   60.475000              NaN  24.275000
76                         NaN              NaN  22.375000
77                         NaN              NaN  22.700000
79                         NaN              NaN  19.750000

[78 rows x 3 columns]